2018/about-note.html
<!DOCTYPE html>
<html lang="zh-CN">
<head>
<!-- 2018-09-15 周六 22:37 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>关于笔记的那些事儿</title>
<meta name="generator" content="Org mode">
<meta name="author" content="rgb-24bit">

<link rel="stylesheet" type="text/css" href="https://rgb-24bit.github.io/org-html-theme-list/org-note/style/main.css">
<!-- Global site tag (gtag.js) - Google Analytics -->



</head>
<body>
<div id="org-div-home-and-up">
 <a accesskey="h" href="https://rgb-24bit.github.io/blog/"> UP </a>
 |
 <a accesskey="H" href="https://rgb-24bit.github.io"> HOME </a>
</div><div id="content">
<h1 class="title">关于笔记的那些事儿</h1>
<div id="table-of-contents">
<h2>&#30446;&#24405;</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org0ecf0ed">1. 前言</a></li>
<li><a href="#org18bcdbf">2. 笔记的作用</a></li>
<li><a href="#org9eae9ba">3. 怎样做笔记</a></li>
<li><a href="#org0041b4f">4. 习惯很重要</a></li>
<li><a href="#org4d67159">5. 结语</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0ecf0ed" class="outline-2">
<h2 id="org0ecf0ed"><span class="section-number-2">1</span> 前言</h2>
<div class="outline-text-2" id="text-1">
<p>
就在刚才， 我完成了每周例行一次的 <b>笔记收集清理</b>, 在一次感受到了部分现有笔记的混乱。
</p>

<p>
心里很想去整理一下， 但准备做的时候又深感无力， 莫名的烦躁充满了全身。
</p>

<p>
虽然真的要做的话， 工作量应该不大， 但主要的工作都是对现有内容的剪切， 分类等。 
</p>

<p>
枯燥， 缺少动力。
</p>

<p>
看了一下其他部分做的比较好的笔记， 突然发现， 这些比较好的笔记是在一开始就做的比较好的， 而不好的那一部分，
一开始也没认真记录。
</p>

<p>
回忆了一下整个笔记的记录过程， 感觉有必要记录下来， 在之后警示自己。
</p>
</div>
</div>

<div id="outline-container-org18bcdbf" class="outline-2">
<h2 id="org18bcdbf"><span class="section-number-2">2</span> 笔记的作用</h2>
<div class="outline-text-2" id="text-2">
<p>
经常听到的一个问题就是： <b>为什么要做笔记 ？</b>
</p>

<p>
这个问题问的就是 <b>笔记的作用</b>, 笔记有什么用， 我为什么做笔记， 做了笔记我能有什么收获， 有什么好处&#x2026;&#x2026;
</p>

<p>
我开始记笔记的时候也想过这些问题， 但没有得到答案， 只是单纯的觉得记笔记可能会有帮助， 便开始记笔记了。
</p>

<p>
现在回过头来， 发现笔记的用处大概就是让我在忘了什么东西的时候， 能够快速的从笔记中找到解决方案。
</p>

<p>
毕竟， 笔记的作用不是让你记住那些东西， 而是把那些东西放在一个你更容易找到的地方。
</p>
</div>
</div>

<div id="outline-container-org9eae9ba" class="outline-2">
<h2 id="org9eae9ba"><span class="section-number-2">3</span> 怎样做笔记</h2>
<div class="outline-text-2" id="text-3">
<p>
怎样做笔记是一个很重要的问题， 这影响到你做的笔记是否能够发挥它的作用。
</p>

<p>
首先， 需要明白的是， 笔记是为了能够让你快速从中找到某个问题的解决方案。
</p>

<p>
如果， 你的笔记系统混乱， 不堪入目， 相信我， 你不会想打开笔记的。
</p>

<p>
因此， 你需要一个 <b>笔记系统</b>, 通过这个系统， 完成 <b>收集</b>, <b>整理</b> 的过程。
</p>

<ul class="org-ul">
<li>收集阶段将需要记录的内容收集起来， 如果是博客那么可以将链接记录下来， 如果是书上的内容， 那么可以将页码记录下来</li>
<li>整理阶段将收集的内容扩展整理， 根据你笔记系统的结构将它们记录到合适的位置</li>
</ul>

<p>
当然， 我还喜欢加上一个 <b>消化</b> 的过程：
</p>
<ul class="org-ul">
<li>将笔记中相似相关的部分内容汇总整理， 理解， 消化， 然后写一篇博客， 算是将笔记的保存位置转移到另一个
地方。 但是经过这个过程能够加深对相关内容的理解， 积累。</li>
</ul>

<p>
个人认为 <b>消化</b> 是一个很有必要的阶段， 当然消化的方式可以看个人爱好， 但是如果不消化的话， 你记的笔记的最大可能就是
被丢在一个角落生灰， 哪怕之后遇到的问题就在你的笔记里面， 你都不知道。
</p>

<p>
在多说一句， 在我看来， 笔记的主要作用就是 <b>记录</b>, 但是记录了的东西不代表就是你的了， 因此， 还需要通过 <b>消化</b> 来进行 <b>积累</b>.
</p>

<p>
那么这三个阶段最重要的是哪个阶段呢 ？
</p>

<p>
最开始， 我觉得是 <b>整理</b> 阶段， 因为如果不整理的话， 那么 <b>收集</b> 就没有作用。
</p>

<p>
后来觉得是 <b>消化</b> 阶段， 因为如果不消化的话， 那么 <b>整理</b> 就没有价值。
</p>

<p>
现在， 我觉得是最重要的是 <b>收集</b> 阶段， 因为如果收集做的不好， 那么后面的工作都将无用。
</p>

<p>
记得以前听到过的一句话： 记笔记有什么用呢 ？ 记了不一定记得好， 记得好也不一定会看。
</p>

<p>
当时觉得这句话挺有道理的， 现在的话， 不对。
</p>

<p>
实际的情况应该是： 笔记记得好， 总有用到它的时候， 笔记记得不好， 你记再多也没有用。
</p>

<p>
就我目前来说， 打开笔记后， 会下意识的回避哪些记得不好的笔记， 不是它们的内容没有用， 而是本能的想回避这些东西。
</p>

<p>
就像开篇说的， 我发现所有记得比较好的笔记都有一个共同的特点： <b>一开始就做的足够好</b>.
</p>

<p>
用物理学上的原理来解释的话： 一个封闭系统的混乱程度 - 熵会不断增加， 除非你为这个系统注入了新的能量。
</p>

<p>
然后， 事实就是， 我们这个世界是科学的， 如果你的笔记一开始就不够好， 除非你愿意花更多的时间和精力进行整理， 否则， 它只会
越来越差。
</p>

<p>
怎样在开始阶段 - <b>收集</b> 就做好呢 ？
</p>

<p>
说实话， 我也没有什么经验， 但记了这么久的笔记， 我觉的还是可以分享一下个人见解：
</p>
<dl class="org-dl">
<dt>规范有序的收集过程</dt><dd>通过规范而有序的收集需要记录的内容， 相信我， 这会让你在 <b>整理</b> 与 <b>消化</b> 的工作量
更少。 也会让你更有动力去整理， 而不是将收集的东西去掉， 然后告诉自己， 少记点没什么。</dd>

<dt>不要只是 Copy &amp; Paste</dt><dd>虽然很多笔记是对现有内容的拷贝， 但是不要什么内容都只是 <code>Copy</code> 和 <code>Paste</code>. 如果
只是靠 <code>Copy</code> 和 <code>Paste</code> 就能完成的工作， 还不如建立一个条目收集指向源的链接。 相信我， 简单 <code>Copy</code> 和 <code>Paste</code>
得到的内容还不如看原有内容好。</dd>

<dt>一定要有收集的过程</dt><dd><p>
其实很多内容在看的时候， 你就会发现， 这些内容似乎可以直接放到 <b>笔记</b>, 而不是放到 <b>收集箱</b>.
因此你选择了将它们直接放入 <b>笔记</b>.
</p>

<p>
但是这样做带来的好处不是很多， 但带来的损失可能更多。 因为在边看边记的过程中， 分心进行记录的话，
容易让你失去整个阅读过程的流畅感， 也无法保证你现在记录的内容的质量。
</p>

<p>
<b>收集</b> 到 <b>整理</b> 是一个缓冲的过程， 通过这个过程， 能够让你将更多的精力放在笔记的整理上， 而不是关心 <b>我该记什么</b>.
</p></dd>
</dl>
</div>
</div>

<div id="outline-container-org0041b4f" class="outline-2">
<h2 id="org0041b4f"><span class="section-number-2">4</span> 习惯很重要</h2>
<div class="outline-text-2" id="text-4">
<p>
记笔记最重要的是什么， 我觉得是 <b>方法</b> 和 <b>习惯</b>.
</p>

<p>
方法前面说过了， 另一个就是习惯。 记笔记的习惯。
</p>

<p>
高中的数学老师说过一句话： <b>优秀是一种习惯</b>.
</p>

<p>
当时不太理解， 现在感觉这句话真的很有道理， 因为优秀的人会在一件事开始的时候， 就习惯性的想要做好它。
</p>

<p>
对于一个好习惯的重要性我就不多说了， 鸡汤喝的再多， 不去实践终究会原封不动的排出去。
</p>

<p>
如果你想记笔记了， 请尝试尽可能的坚持一段时间， 然后， 在慢慢优化改进自己的笔记系统。
</p>

<p>
到时候， 你会发现， 记笔记只是一种习惯， 我们需要做的只是在记笔记时记好， 而不是去考虑需不需要做笔记的问题。
</p>
</div>
</div>

<div id="outline-container-org4d67159" class="outline-2">
<h2 id="org4d67159"><span class="section-number-2">5</span> 结语</h2>
<div class="outline-text-2" id="text-5">
<p>
作为一个程序员， 身处这个技术发展日新月异的时代， 深感无力。
</p>

<p>
因为明白一点， 在这个时代， 你不进步， 那么你已经退步了。 因为有很多人正快速的赶超你。
</p>

<p>
有时真的羡慕那些天赋好的人， 花更少的时间， 做到更多的事情。 最重要的是， 他们也在努力。
</p>

<p>
笔记是一种手段， 提高自己， 不让自己落后太多的手段。
</p>

<p>
共勉 (｀・ω・´)
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
版权声明:自由转载-非商用-非衍生-保持署名(<a href="http://creativecommons.org/licenses/by-nc-nd/3.0/deed.zh">创意共享3.0许可证</a>)
<div id="disqus_thread"></div>
<script type="text/javascript">
  var disqus_shortname = 'rgb-24bit';
  (function() {
    var dsq = document.createElement('script'); dsq.type = 'text/javascript'; dsq.async = true;
    dsq.src = '//' + disqus_shortname + '.disqus.com/embed.js';
    (document.getElementsByTagName('head')[0] || document.getElementsByTagName('body')[0]).appendChild(dsq);
  })();
</script>
</div>
</body>
</html>
